caoyue0115/Tiny_Machine_Robot/esp_idf_demo/sdkconfig.defaults.vocat_lowcost_16m8m
# ESP-VoCat v1.0 audio PCB low-cost profile: 16MB Flash + 8MB Octal PSRAM.
# Use explicitly via:
#   SDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.vocat_lowcost_16m8m"
#
# This file must not change OTA release gates or embed runtime secrets.

CONFIG_IDF_TARGET="esp32s3"

# v6 N16R8 low-cost boards use the ESP-VoCat V1.0 audio PCB routing:
# I2S DIN/DSIN=GPIO15, PA=GPIO4, and no GPIO48 speaker/mic enable.
CONFIG_DEMO_TARGET_PROFILE_VOCAT_LOWCOST_16M8M=y
CONFIG_DEMO_AUDIO_PCB_ESP_VOCAT_V1_0=y

# Keep the v5/v6 default 16MB flash geometry for the first low-cost stage.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Keep the existing default partition table in stage 1.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Target board has 8MB Octal PSRAM; keep type auto so boot probes the real
# density.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Keep behavior deterministic across local sdkconfig states.
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# WakeNet spike: keep models in the ESP-SR flash model path. This still expects
# an ESP-SR "model" partition at runtime unless the build tooling proves an
# alternate model packaging path.
CONFIG_MODEL_IN_FLASH=y
CONFIG_SR_WN_WN9_XIAOMINGTONGXUE_TTS2=y

# esp-wifi-connect invokes C++ callbacks and scan handling from the system
# event task. Keep this aligned with the upstream Xiaozhi WiFi profile.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

CONFIG_COMPILER_OPTIMIZATION_PERF=y
